<?php
// -------------------------------------------------------------------------------------------------
// セッションクラス
//
// History:
// 0.00.00 2024/01/23 作成。
// -------------------------------------------------------------------------------------------------
namespace tsubasaLibs\web;
require_once __DIR__ . '/SessionUser.php';
/**
 * セッションクラス
 * 
 * @version 0.00.00
 */
class Session {
    // ---------------------------------------------------------------------------------------------
    // プロパティ
    /** @var SessionUser ログインユーザ */
    public $user;
    // ---------------------------------------------------------------------------------------------
    // コンストラクタ/デストラクタ
    public function __construct() {
        if (session_status() === PHP_SESSION_NONE)
            session_start();
        $this->user = $this->getUser();
    }
    // ---------------------------------------------------------------------------------------------
    // 内部処理
    /**
     * ユーザ情報取得
     */
    protected function getUser(): SessionUser {
        return new SessionUser();
    }
}