<?php
// -------------------------------------------------------------------------------------------------
// タスククラス
//
// History:
// 0.47.00 2024/10/19 作成。
// -------------------------------------------------------------------------------------------------
namespace tsubasaLibs\web;

/**
 * タスククラス
 * 
 * @since 0.47.00
 * @version 0.47.00
 */
class Task {
    // ---------------------------------------------------------------------------------------------
    // プロパティ
    /** @var Events イベント */
    protected $events;

    // ---------------------------------------------------------------------------------------------
    // コンストラクタ/デストラクタ
    public function __construct(Events $events) {
        $this->events = $events;

        // 初期設定
        $this->setInit();
    }

    // ---------------------------------------------------------------------------------------------
    // メソッド
    /**
     * 実行
     */
    public function exec() {
        if (!$this->process())
            throw new WebException(sprintf('Task failed: %s', static::class));
    }

    // ---------------------------------------------------------------------------------------------
    // 内部処理
    /**
     * 初期設定
     */
    protected function setInit() {}

    /**
     * 処理
     * 
     * @return bool 成否
     */
    protected function process(): bool {
        return false;
    }
}