<?php
// -------------------------------------------------------------------------------------------------
// Web処理の例外クラス
//
// History:
// 0.22.00 2024/05/17 作成。
// 0.87.04 2025/04/24 トレースにファイルパスや行番号がなかった場合へ対応。
// 1.01.02 2025/10/01 common\Exceptionを継承するように変更。
// -------------------------------------------------------------------------------------------------
namespace tsubasaLibs\web;
require_once __DIR__ . '/../common/Exception.php';
use tsubasaLibs\common;

/**
 * Web処理の例外クラス
 * 
 * @since 0.22.00
 * @version 1.01.02
 */
class WebException extends common\Exception {
    // ---------------------------------------------------------------------------------------------
    // 定数(オーバーライド)
    /** 例外名 */
    const EXCEPTION_NAME = 'WebException';
}