<?php
// -------------------------------------------------------------------------------------------------
// ライブラリローダ
//
// History:
// 0.00.00 2024/01/23 作成。
// 0.08.00 2024/02/27 Smartyプラグインを追加。
// 0.09.00 2024/03/06 cURLクラス、APIイベントクラスを追加。
// 0.12.00 2024/03/12 APIメソッドクラスを追加。
// 0.26.00 2024/05/22 CSV書き込みクラスを追加。
// 0.28.00 2024/06/26 TCPDFクラスを追加。
// 0.28.01 2024/06/26 ローダを各サブライブラリへ分割。
// -------------------------------------------------------------------------------------------------
require_once __DIR__ . '/type/loader.php';
require_once __DIR__ . '/database/loader.php';
require_once __DIR__ . '/web/loader.php';
require_once __DIR__ . '/csv/loader.php';
require_once __DIR__ . '/pdf/loader.php';
require_once __DIR__ . '/api/loader.php';