<?php
// -------------------------------------------------------------------------------------------------
// PDF処理の例外クラス
//
// History:
// 0.28.02 2024/06/27 作成。
// -------------------------------------------------------------------------------------------------
namespace tsubasaLibs\pdf;
require_once __DIR__ . '/../common/Exception.php';
use tsubasaLibs\common;
/**
 * PDF処理の例外クラス
 * 
 * @since 0.28.02
 * @version 0.28.02
 */
class PdfException extends common\Exception {
    // ---------------------------------------------------------------------------------------------
    // 定数(オーバーライド)
    /** 例外名 */
    const EXCEPTION_NAME = 'PdfException';
}