<?php
// -------------------------------------------------------------------------------------------------
// SmartyクラスのPHPDoc
//
// History:
// 0.08.00 2024/02/27 作成。
// -------------------------------------------------------------------------------------------------
use tsubasaLibs\web\WebException;

class Smarty {
    // ---------------------------------------------------------------------------------------------
    // コンストラクタ/デストラクタ
    public function __construct() {
        throw new WebException('Smarty hasn\'t been installed');
    }
}